Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 138 */
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_138 {7, 0}
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 139 */
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_139 {7, 0}
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 140 */
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_140 {7, 0}
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 141 */
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_141 {7, 0}
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 142 */
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_142 {7, 0}
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 143 */
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_143 {7, 0}
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 144 */
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_144 {7, 0}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 145 */
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_145 {7, 0}
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 146 */
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 147 */
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 148 */
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 149 */
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 150 */
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 151 */
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 152 */
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 153 */
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 154 */
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 155 */
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 156 */
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 157 */
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 158 */
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 159 */
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 160 */
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 161 */
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 162 */
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 163 */
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 164 */
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 165 */
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 166 */
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 167 */
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 168 */
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 169 */
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 170 */
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 171 */
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

