Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 172 */
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 173 */
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 174 */
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 175 */
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 176 */
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 177 */
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 178 */
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 440 */
#define PIN_FUNCTION_REG_440_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_440_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 441 */
#define PIN_FUNCTION_REG_441_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_441 {10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_441 {0, 0} 

/* Pad: 442 */
#define PIN_FUNCTION_REG_442_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_442 {10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_442 {0, 0} 

/* Pad: 443 */
#define PIN_FUNCTION_REG_443_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_443_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_443 {0, 0} 

/* Pad: 444 */
#define PIN_FUNCTION_REG_444_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_444 {10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_444 {0, 0} 

/* Pad: 445 */
#define PIN_FUNCTION_REG_445_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_445_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_445 {0, 0} 
#define PIN_FUNCTION_REG_445_PORT_PIN_MODE_OTHER2 PORT_FUNC3 

/* Pad: 446 */
#define PIN_FUNCTION_REG_446_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_446_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_446_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_446 {0, 0} 

/* Pad: 447 */
#define PIN_FUNCTION_REG_447_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_447_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_447_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_447 {0, 0} 

/* Pad: 448 */
#define PIN_FUNCTION_REG_448_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_448_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_448_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_448 {0, 0} 

/* Pad: 449 */
#define PIN_FUNCTION_REG_449_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_449 {10, 0}
#define PIN_FUNCTION_REG_449_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_449 {0, 0} 

/* Pad: 450 */
#define PIN_FUNCTION_REG_450_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_450 {10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_450 {0, 0} 

/* Pad: 451 */
#define PIN_FUNCTION_REG_451_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_451 {10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_451 {0, 0} 

/* Pad: 452 */
#define PIN_FUNCTION_REG_452_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_452 {10, 0}

/* Pad: 453 */
#define PIN_FUNCTION_REG_453_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_453 {10, 0}
#define PIN_FUNCTION_REG_453_PORT_PIN_MODE_CAN PORT_FUNC3

/* Pad: 454 */
#define PIN_FUNCTION_REG_454_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_454 {10, 0}
#define PIN_FUNCTION_REG_454_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_454_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 455 */
#define PIN_FUNCTION_REG_455_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_455 {10, 0}
#define PIN_FUNCTION_REG_455_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_455_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 456 */
#define PIN_FUNCTION_REG_456_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_456 {10, 0}
#define PIN_FUNCTION_REG_456_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_456 {1, 0}
#define PIN_FUNCTION_REG_456_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 457 */
#define PIN_FUNCTION_REG_457_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_457_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_457_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_457_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 458 */
#define PIN_FUNCTION_REG_458_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_458_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_458_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_458_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 459 */
#define PIN_FUNCTION_REG_459_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_459_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_459_PORT_PIN_MODE_LIN PORT_FUNC2 

/* Pad: 460 */
#define PIN_FUNCTION_REG_460_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_460_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_460_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_460_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 461 */
#define PIN_FUNCTION_REG_461_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_461_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_461_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_461 {4, 8}
#define PIN_FUNCTION_REG_461_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 462 */
#define PIN_FUNCTION_REG_462_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_462_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_462_PORT_PIN_MODE_LIN PORT_FUNC2 

/* Pad: 463 */
#define PIN_FUNCTION_REG_463_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_463_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_463_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_463 {4, 16}

/* Pad: 464 */
#define PIN_FUNCTION_REG_464_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_464_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_464_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 465 */
#define PIN_FUNCTION_REG_465_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_465_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_465_PORT_PIN_MODE_SPI PORT_FUNC2

