Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 466 */
#define PIN_FUNCTION_REG_466_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_466_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_466_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 467 */
#define PIN_FUNCTION_REG_467_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_467_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_467_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 468 */
#define PIN_FUNCTION_REG_468_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_468_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_468_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_468_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 469 */
#define PIN_FUNCTION_REG_469_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_469_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_469_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_469 {2, 4194304}
#define PIN_FUNCTION_REG_469_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 470 */
#define PIN_FUNCTION_REG_470_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_470_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_470_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_470 {2, 262144}
#define PIN_FUNCTION_REG_470_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 471 */
#define PIN_FUNCTION_REG_471_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_471_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_471_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_471_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 472 */
#define PIN_FUNCTION_REG_472_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_472_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_472_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_472 {2, 1048576}
#define PIN_FUNCTION_REG_472_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 179 */
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 180 */
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_SPI PORT_FUNC4

/* Pad: 181 */
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_SPI PORT_FUNC4

/* Pad: 182 */
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_SPI PORT_FUNC4

/* Pad: 183 */
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_SPI PORT_FUNC4

/* Pad: 184 */
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 185 */
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 186 */
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 187 */
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 188 */
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 189 */
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_189 {2, 524288}

/* Pad: 190 */
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_190 {2, 2097152}

/* Pad: 191 */
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 192 */
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 193 */
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_CAN PORT_FUNC3
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC4

/* Pad: 194 */
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_CAN PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_194 {1, 1024}
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER0 PORT_FUNC4

