Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 195 */
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_CAN PORT_FUNC3
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER1 PORT_FUNC4 

/* Pad: 196 */
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_CAN PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_196 {1, 8}
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER1 PORT_FUNC4 

/* Pad: 197 */
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 198 */
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 199 */
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 200 */
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 201 */
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 202 */
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER1 PORT_FUNC3 

/* Pad: 203 */
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_203 {2, 1024}

/* Pad: 204 */
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 432 */
#define PIN_FUNCTION_REG_432_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_432_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_432_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 433 */
#define PIN_FUNCTION_REG_433_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_433_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_433_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 434 */
#define PIN_FUNCTION_REG_434_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_434_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_434_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_434 {2, 131072}

/* Pad: 435 */
#define PIN_FUNCTION_REG_435_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_435_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_435_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 436 */
#define PIN_FUNCTION_REG_436_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_436_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_436_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 437 */
#define PIN_FUNCTION_REG_437_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_437_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_437_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 476 */
#define PIN_FUNCTION_REG_476_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_476 {7, 1073741824}
#define PIN_FUNCTION_REG_476_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 477 */
#define PIN_FUNCTION_REG_477_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_477 {7, 268435456}
#define PIN_FUNCTION_REG_477_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 478 */
#define PIN_FUNCTION_REG_478_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_478 {7, 67108864}
#define PIN_FUNCTION_REG_478_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 479 */
#define PIN_FUNCTION_REG_479_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_479 {7, 16777216}
#define PIN_FUNCTION_REG_479_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 480 */
#define PIN_FUNCTION_REG_480_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_480 {7, 4194304}
#define PIN_FUNCTION_REG_480_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 481 */
#define PIN_FUNCTION_REG_481_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_481 {7, 1048576}
#define PIN_FUNCTION_REG_481_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 482 */
#define PIN_FUNCTION_REG_482_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_482 {7, 262144}
#define PIN_FUNCTION_REG_482_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 483 */
#define PIN_FUNCTION_REG_483_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_483 {7, 65536}
#define PIN_FUNCTION_REG_483_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 484 */
#define PIN_FUNCTION_REG_484_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_484 {10, 1073741824}
#define PIN_FUNCTION_REG_484_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 485 */
#define PIN_FUNCTION_REG_485_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_485 {10, 268435456}
#define PIN_FUNCTION_REG_485_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 486 */
#define PIN_FUNCTION_REG_486_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_486 {10, 67108864}
#define PIN_FUNCTION_REG_486_PORT_PIN_MODE_PWM PORT_FUNC3 

