Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 487 */
#define PIN_FUNCTION_REG_487_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_487 {10, 16777216}
#define PIN_FUNCTION_REG_487_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 488 */
#define PIN_FUNCTION_REG_488_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_488 {10, 4194304}
#define PIN_FUNCTION_REG_488_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 489 */
#define PIN_FUNCTION_REG_489_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_489 {10, 1048576}
#define PIN_FUNCTION_REG_489_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 490 */
#define PIN_FUNCTION_REG_490_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_490 {10, 262144}
#define PIN_FUNCTION_REG_490_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 491 */
#define PIN_FUNCTION_REG_491_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_491 {10, 65536}
#define PIN_FUNCTION_REG_491_PORT_PIN_MODE_PWM PORT_FUNC3 

/* Pad: 475 */
#define PIN_FUNCTION_REG_475_PORT_PIN_MODE_DIO PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_475 {0, 0}

/* Pad: 474 */
#define PIN_FUNCTION_REG_474_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_474_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_474 {0, 4096}

/* Pad: 248 */
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_248 {0, 1}

/* Pad: 249 */
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_249 {0, 4}

/* Pad: 250 */
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_250 {0, 16}

/* Pad: 251 */
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_251 {0, 64}

/* Pad: 252 */
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_ETH PORT_FUNC1
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 253 */
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_ETH PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_253 {0, 1024}

/* Pad: 83 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC3 

/* Pad: 84 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_84 {4, 4}
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_84 {1, 1} 

/* Pad: 85 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 86 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 87 */
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 88 */
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_LIN PORT_FUNC3 

/* Pad: 246 */
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 247 */
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_CAN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_247 {1, 0}
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_247 {1, 4}

/* Pad: 89 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_LIN PORT_FUNC1 

/* Pad: 90 */
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_90 {4, 0}

/* Pad: 91 */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_CAN PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_91 {1, 2}

/* Pad: 92 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_92 {4, 0}
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 244 */
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_LIN PORT_FUNC1 

/* Pad: 245 */
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_LIN PORT_FUNC1 

/* Pad: 93 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_CAN PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_93 {0, 16384} 

/* Pad: 94 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 95 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 96 */
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 97 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER0 PORT_FUNC2

