Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 98 */
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER1 PORT_FUNC4

/* Pad: 99 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_LIN PORT_FUNC4 

/* Pad: 100 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 101 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 102 */
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 103 */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 104 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 105 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_105 {2, 0}
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 106 */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_106 {2, 0}

/* Pad: 107 */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_107 {0, 65536} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 108 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_108 {2, 16384}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_108 {0, 262144} 

/* Pad: 109 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_109 {2, 4096}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_109 {0, 1048576} 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 110 */
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_110 {2, 65536}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_110 {0, 4194304} 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 235 */
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_235 {2, 0}
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 236 */
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_236 {2, 0}
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 237 */
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 238 */
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_238 {2, 0}
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 239 */
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_LIN PORT_FUNC2 

/* Pad: 240 */
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_240 {2, 0}

/* Pad: 241 */
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_241 {2, 0}

/* Pad: 242 */
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_OTHER1 PORT_FUNC4

/* Pad: 243 */
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_243 {1, 3}
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_243 {2, 8388608}

/* Pad: 256 */
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_OTHER0 PORT_FUNC1

