Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 257 */
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 258 */
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 259 */
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 260 */
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 261 */
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 262 */
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 263 */
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 264 */
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_264_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 265 */
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_265_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 266 */
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_266_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 267 */
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_267_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 268 */
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_268_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 269 */
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_269_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 270 */
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_270_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 271 */
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_271_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 272 */
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_272_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 273 */
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_273_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 274 */
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_274_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 275 */
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_275_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 276 */
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_276_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 277 */
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_277_PORT_PIN_MODE_OTHER1 PORT_FUNC2 

/* Pad: 278 */
#define PIN_FUNCTION_REG_278_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_278_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 279 */
#define PIN_FUNCTION_REG_279_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_279_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 280 */
#define PIN_FUNCTION_REG_280_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_280_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 281 */
#define PIN_FUNCTION_REG_281_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_281_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 282 */
#define PIN_FUNCTION_REG_282_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_282_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 283 */
#define PIN_FUNCTION_REG_283_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_283_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 284 */
#define PIN_FUNCTION_REG_284_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_284_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 285 */
#define PIN_FUNCTION_REG_285_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_285_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 286 */
#define PIN_FUNCTION_REG_286_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_286_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 287 */
#define PIN_FUNCTION_REG_287_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_287_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 288 */
#define PIN_FUNCTION_REG_288_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_288_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 289 */
#define PIN_FUNCTION_REG_289_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_289_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 290 */
#define PIN_FUNCTION_REG_290_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_290_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 291 */
#define PIN_FUNCTION_REG_291_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_291_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 292 */
#define PIN_FUNCTION_REG_292_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_292_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 293 */
#define PIN_FUNCTION_REG_293_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_293_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 294 */
#define PIN_FUNCTION_REG_294_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_294_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 295 */
#define PIN_FUNCTION_REG_295_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_295_PORT_PIN_MODE_OTHER0 PORT_FUNC1

