Anyc-Qing/AUTOSAR/core/mcal/Port/inc/mpc5777c_portdefs.h
/* Pad: 296 */
#define PIN_FUNCTION_REG_296_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_296_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 297 */
#define PIN_FUNCTION_REG_297_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_297_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 298 */
#define PIN_FUNCTION_REG_298_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_298_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 299 */
#define PIN_FUNCTION_REG_299_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_299_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 300 */
#define PIN_FUNCTION_REG_300_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_300_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 301 */
#define PIN_FUNCTION_REG_301_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_301_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 302 */
#define PIN_FUNCTION_REG_302_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_302_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 303 */
#define PIN_FUNCTION_REG_303_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_303_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 304 */
#define PIN_FUNCTION_REG_304_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_304_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 305 */
#define PIN_FUNCTION_REG_305_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_305_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 306 */
#define PIN_FUNCTION_REG_306_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_306_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 307 */
#define PIN_FUNCTION_REG_307_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_307_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 211 */
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 212 */
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_212 {10, 1} 
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 213 */
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_213 {10, 4} 
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 208 */
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 209 */
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER1 PORT_FUNC4 

/* Pad: 210 */
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_210 {10, 64} 
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER2 PORT_FUNC4 

/* Pad: 220 */
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 221 */
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 222 */
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 223 */
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_LIN PORT_FUNC2 

/* Pad: 75 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 76 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 77 */
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 78 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 79 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 80 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 81 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 82 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 231 */
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 232 */
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 233 */
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 234 */
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_DIO PORT_FUNC0


#endif  /* _MPC5777CPORTDEFS_H*/
